import json

# yes24 카테고리 코드
category_numbers = {
    '가정 살림': '001001001',
    '건강 취미': '001001011',
    '경제 경영': '001001025',
    '국어 외국어 사전': '001001004',
    '대학교재': '001001014',
    '만화/라이트노벨': '001001008',
    '사회 정치': '001001022',
    '소설/시/회곡': '001001046',
    '수험서 자격증': '001001015',
    '어린이': '001001016',
    '에세이': '001001047',
    '여행': '001001009',
    '역사': '001001010',
    '예술': '001001007',
    '유아': '001001027',
    '인문': '001001019',
    '인물': '001001020',
    '자기계발': '001001026',
    '자연과학': '001001002',
    '잡지': '001001024',
    '전집': '001001023',
    '종교': '001001021',
    '청소년': '001001005',
    'IT 모바일': '001001003',
    '초등참고서': '001001044',
    '중고등참고서': '001001013',
}

category_details = {
    'IT모바일': {
        '게임':'001001003027',
        '그래픽/디자인/멀티미디어':'001001003028',
        '네트워크/해킹/보안':'001001003024',
        '모바일 프로그래밍':'001001003023',
        '모바일/태블릿/SNS':'001001003021',
        '오피스 활용':'001001003029',
        '웹사이트':'001001003020',
        '인터넷 비즈니스':'001001003026',
        '컴퓨터 공학':'001001003031',
        '컴퓨터 수험서':'001001003030',
        '컴퓨터 입문/활용':'001001003019',
        '프로그래밍 언어':'001001003022',
        'OS/데이터페이스':'001001003025'
    },
    '소설/시/희곡':{},
}


with open('./category/yes24_categories.json', 'w', encoding='utf-8') as f:
    json.dump(category_numbers, f, ensure_ascii=False)

with open('./category/yes24_category_details.json', 'w', encoding='utf-8') as f:
    json.dump(category_details, f, ensure_ascii=False)